Revit 2024 API
BuiltInFailures.ElectricalFailures.CircuitOverload Property
 Total connected load for Circuit [Name] is exceeding 80% of the defined rating ([Rating Value]).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircuitOverload { get; }
Visual Basic
Public Shared ReadOnly Property CircuitOverload As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircuitOverload {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace